<h1> LETS LEARN PANDAS</h1>

In [155]:
import pandas as pd,numpy as np  #importing on same line
#making dummy datas
a=np.random.randint(1,10,5)
a

array([8, 3, 5, 5, 8])

In [156]:

b=('a-b-c-d-e').split('-')
b

['a', 'b', 'c', 'd', 'e']

<h3>1d pandas</h3>

In [157]:
pd.Series(a)

0    8
1    3
2    5
3    5
4    8
dtype: int64

In [158]:
pd.Series(data=a) #taking datas from variable a

0    8
1    3
2    5
3    5
4    8
dtype: int64

In [159]:
pd.Series(data=a,index=b) #taking index from b

a    8
b    3
c    5
d    5
e    8
dtype: int64

lets start 2D ok guys

<h1>#DATAFRAMES<h1>

lets try with numbers

In [160]:
a=np.random.randint(1,20,(5,3))
a

array([[19, 16, 16],
       [14, 14,  3],
       [10,  7,  5],
       [11, 10, 12],
       [10, 18, 19]])

In [161]:
df=pd.DataFrame(a)
df

    0   1   2
0  19  16  16
1  14  14   3
2  10   7   5
3  11  10  12
4  10  18  19

In [162]:
df.describe()   #shows min,avg and max as well as others in table

               0          1          2
count   5.000000   5.000000   5.000000
mean   12.800000  13.000000  11.000000
std     3.834058   4.472136   6.892024
min    10.000000   7.000000   3.000000
25%    10.000000  10.000000   5.000000
50%    11.000000  14.000000  12.000000
75%    14.000000  16.000000  16.000000
max    19.000000  18.000000  19.000000

In [163]:
df.max(axis=1)   #axis=0 means horizontal and 1 vertical
df.max(axis=0)

0    19
1    18
2    19
dtype: int64

In [164]:
#making dummy datas for 2d pandas
a={'animal':['cat','dog','pandas','snake'],
  'cost':[100,200,300,350],
  'country':['japan','china','america','denmark']}
pd.Series(a)

animal            [cat, dog, pandas, snake]
cost                   [100, 200, 300, 350]
country    [japan, china, america, denmark]
dtype: object

In [165]:
df=pd.DataFrame(a)
df

   animal  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3   snake   350  denmark

In [166]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [167]:
df.shape

(4, 3)

In [168]:
df.columns

Index(['animal', 'cost', 'country'], dtype='object')

#if you dont want country in ur list

In [169]:
df[['animal','cost']]

   animal  cost
0     cat   100
1     dog   200
2  pandas   300
3   snake   350

#only shows above 2 list

In [170]:
df.head(2)

  animal  cost country
0    cat   100   japan
1    dog   200   china

In [171]:
#only shows below 2 list

In [172]:
df.tail(2)

   animal  cost  country
2  pandas   300  america
3   snake   350  denmark

In [173]:
df['animal'].value_counts()

pandas    1
dog       1
snake     1
cat       1
Name: animal, dtype: int64

In [174]:
df[df.cost==df.cost.max()] #checks the animal with highest cost

  animal  cost  country
3  snake   350  denmark

In [175]:
#if we wanna change snake name to python
df.replace('snake','python')

   animal  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3  python   350  denmark

In [176]:
df.rename(columns={'animal':'pets'}) #chaning the title or column of the table

     pets  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3   snake   350  denmark

<h3>It is boolean classifier (powerful) which classifies data is present in table or not</h3>

In [177]:
 df.cost==100

0     True
1    False
2    False
3    False
Name: cost, dtype: bool

<h4>When inside df[] dataframe is also shown</h4>

In [178]:
df[ df.cost==100 ]

  animal  cost country
0    cat   100   japan

In [179]:
df[df.country=='japan'] #searching with country name

  animal  cost country
0    cat   100   japan

In [180]:
df.sort_values(by='country',ascending=True) #sorts country  in ascending order

   animal  cost  country
2  pandas   300  america
1     dog   200    china
3   snake   350  denmark
0     cat   100    japan

In [181]:
df.sort_values(by=['animal','cost'],ascending=[True,True]) #multiple sorting

   animal  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3   snake   350  denmark

In [182]:
#concatination of different dataframes

In [183]:
temp=pd.DataFrame({
    'city':['mumbai','tokyo'],
    'temp':[30,22]
})
temp

     city  temp
0  mumbai    30
1   tokyo    22

In [184]:
wind=pd.DataFrame({
    'city':['mumbai','tokyo'],
    'wind':['7','12']
    
})
wind

     city wind
0  mumbai    7
1   tokyo   12

In [185]:
df=pd.concat([temp,wind],axis=0,keys=['mumbai','tokyo'],sort=True)
df

            city  temp wind
mumbai 0  mumbai  30.0  NaN
       1   tokyo  22.0  NaN
tokyo  0  mumbai   NaN    7
       1   tokyo   NaN   12

In [186]:
g=df.groupby('city')
#prints all the elements within g
for i,j in g:
    print(i)
    print(j)

mumbai
            city  temp wind
mumbai 0  mumbai  30.0  NaN
tokyo  0  mumbai   NaN    7
tokyo
           city  temp wind
mumbai 1  tokyo  22.0  NaN
tokyo  1  tokyo   NaN   12

In [187]:
g.get_group('tokyo') #groups tokyo in one place

           city  temp wind
mumbai 1  tokyo  22.0  NaN
tokyo  1  tokyo   NaN   12

In [188]:
g.min()

        temp
city
mumbai  30.0
tokyo   22.0